module Game.App.World
open Types

let location name description exits =
    {   id = name
        name = name
        description = description
        exits = exits
    }

let world =
    [   "Спуск к морю",
            "Стопы утопают в песке пляжа. Шум волн заполняет всё
            вокруг. Пахнет морем.",
            [   "вдоль моря налево", "Пляж с ракушками"
                "вдоль моря направо", "Пляж с камушками"
                "в дюны", "Дюны"
            ]
        "Пляж с ракушками", "Море простирается до самого горизонта.",
            [ "вдоль моря направо", "Спуск к морю" ]
        "Пляж с камушками", "На севере море.",
            [ "вдоль моря налево", "Спуск к морю" ]
        "Дюны",
            "Сосны, дюны, редкая трава, а в песке сухие палочки и
            шишки",
            [ "вниз к морю", "Спуск к морю" ]
    ]   |> List.map (fun (name, description, exits) ->
            name, location name description exits
        )
        |> Map.ofList
